#language: ru

@tree

Функционал: Проверка расчёта итогового колличества в документе Заказ

Как Менеджер по закупкам я хочу
проверить расчёт итогового колличества в документе Заказ 
чтобы знать точное итоговое количество товаров 

Сценарий: Проверка расчёта итогового колличества в документе Заказ
	* Заполнение шапки документа
	* Ввод 2х товаров
	* Проверка итогового колличества
	* Ввод услуги
	* Проверка итогового колличества
	* Изменение колличество у товаров
	* Проверка итогового колличества
	* Удалене 1го товара
	* Проверка итогового колличества
	* Удаление услуги
	* Проверка итогового колличества
	* Закрытие документа без сохранения

	
